Tekla Open API Reference for Tekla Structures 2025
IEvents.Register Method
 Registers the instance to listen to the specified events.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void Register()
Sub Register
Exceptions
Exception | Condition
InvalidOperationException | Thrown if attempting registration when already registered.
See Also
Reference
IEvents Interface
Tekla.Structures.Drawing Namespace